Repository: kids4it/workshop-results
Catalog: 2019/20190921-k4it-wob/unity-playground/Zoey/Assets/_INTERNAL_/Resources/Localization/*.po
Languages: de

source: When this object touches another that has the script DestroyForPoints, the Player will get a point.
de: Wenn dieses Objekt ein anderes Objekt mit dem Skript DestroyForPoints berührt, erhält der Spieler einen Punkt.

source: An action failed and interrupted the chain of Actions
de: Eine Aktion ist fehlgeschlagen und hat nachfolgende Aktionen abgebrochen.

source: When the Player touches this object, it will be awarded one or more points.
de: Wenn der Spieler dieses Objekt berührt, erhält er einen oder mehrere Punkte.

source: When this object is destroyed, the player gets one or more points.
de: Wenn dieses Objekt zerstört wird, erhält der Spieler einen oder mehrere Punkte.

source: This scripts allows the Players or other objects to receive damage.
de: Dieses Skript erlaubt es Spielern oder Objekten schaden zu nehmen.

source: This GameObject will damage or heal other GameObjects on impact (only if they use the HealthSystemAttribute). Negative values mean damage, positive values mean healing (like a medipack).
de: Dieses GameObject wird Schaden austeilen oder Leben regenerieren wenn es ein anderes Objekt berührt (diese benötigen ein "HealthSystemAttribute"). Negative Werte bedeuten Schaden und positive Werte bedeuten Heilung.

source: This object will damage on impact
de: Dieses Objekt wird bei Berührung schaden zufügen.

source: This object will heal on impact
de: Dieses Objekt wird bei Berührung heilen.

source: This object will have no effect
de: Dieses Objekt wird bei Berührung keinen Effekt haben.

source: When the Player touches this object, they will collect the specified amount of this type of resource.
de: Wenn der Spieler dieses Objekt berührt, sammelt er die angegebene Menge an Ressourcen.

source: Type of Resource
de: Ressourcentyp

source: Add/Remove types
de: Typen bearbeiten

source: Gameplay Actions
de: Gameplay Aktionen

source: - Empty slot -
de: - Leerer Slot -

source: Use custom actions
de: Eigene Aktionen verwenden

source: Filter By Tag
de: Nach Tag filtern

source: Tag to check for
de: Zu überprüfenden Tag

source: Select a Prefab from Project panel, not an object in the Hierarchy!
de: Wähle ein Prefab vom Projekt-Fenster, nicht vom Hierachie-Fenster!

source: No Prefab selected!
de: Kein Prefab ausgewählt.

source: Disable "Is Trigger" on the Collider to make this script work!
de: Deaktiviere "Ist Auslöser" auf dem Collider, damit dieses Skript funktioniert.

source: Enable "Is Trigger" on the Collider to make this script work!
de: Aktiviere "Ist Auslöser" auf dem Collider, damit dieses Skript funktioniert.

source: Use this script to check if the player has enough of a specific resource. If they have it, it will be removed from the Player's inventory.
de: Benutze dieses Skript um zu erkennen ob ein Spieler genug von der Ressource besitzt. Wenn das so ist, dann werden diese Ressourcen aus seinem Inventar entfernt.

source: Use this script to create a new GameObject from a Prefab in a specific position.
de: Benutze dieses Skript um neue GameObjects aus Prefabs an einer bestimmten Position zu erstellen.

source: Destroys a GameObject instantaneously on impact. Could be this object, or the one that suffered the impact.
de: Zerstört ein GameObject sofort bei Berührung. Entweder dieses Objekt oder ein berührtes Objekt.

source: TIP: You can assign a death effect, such as an explosion or another particle system.
de: Tipp: Du kannst eine Todeseffekt hinzufügen, wie beispielsweise eine Explosion oder andere Partikel-Systeme.

source: Use this script to create a dialogue ballon on a character's head.
de: Benutze dieses Skript um eine Sprechblase über einen Charakterkopf erscheinen zu lassen.

source: TIP: Connect another DialogueBalloonAction in the last slot to create a continuous conversation.
de: Tipp: Verbinde eine andere "DialogueBalloonAction" im letzten Slot damit eine fortlaufende Konversation erstellt wird.

source: Use this script to restart the level, or load another one (load another Unity scene).
de: Benutze dieses Skript um ein Level neu zu starten oder ein anderes zu laden (eine andere Unity Szene laden).

source: WARNING: Make sure the scene is enabled in the Build Settings scenes list.
de: WARNUNG: Du musst sicherstellen, dass die Szene in der Szenenliste der Build-Einstellungen aktiviert ist.

source: WARNING; To add a new level, save a Unity scene and then go to File > Build Settings... and add the scene to the list.
de: WARNUNG: Um ein Level hinzuzufügen, speichere erst die Unity Szene und gehe dann zu Datei > Build Einstellungen... und dann füge die Szene der Liste hinzu.

source: RELOAD LEVEL
de: LEVEL NEU LADEN

source: Scene to load
de: Szene

source: No scenes available!
de: Keine Szenen verfügbar.

source: Use this script to turn an object on or off.
de: Benutze diese Skript um ein Objekt zu aktivieren oder deaktivieren.

source: TIP: The object will be made invisible, but it will still collide with others.
de: Hinweis: Das Objekt wird unsichtbar, aber kann immer noch andere Objekte berühren.

source: Use this script to teleport this or another object to a new location.
de: Benutze dieses Skript um dieses Objekt oder eine anders zu einer neuen Position zu teleportieren.

source: WARNING: If you don't assign a GameObject, this GameObject will be teleported!
de: WARNUNG: Wenn du kein GameObject zuweist, wird dieses GameObject teleportiert!

source: Perform actions when a GameObject enters, exits, or stays inside the trigger collider (in this last case you get to choose the frequency).
de: Löst Aktionen aus, wenn ein GameObject ein anderes betritt, verlässt oder bleibt. Wenn es bleibt, kannst du festlegen wie oft die Aktion ausgelöst werden soll.

source: Use this script to perform an action when this GameObject collides with another.
de: Benutze dieses Skript um eine Aktion auszuführen, wenn dieses GameObject ein anderes berührt.

source: Use this script to perform an action when a button is pressed, released, or as long as it's kept pressed (in this case you get to choose the frequency).
de: Benutze dieses Skript um eine Aktion auszuführen, wenn ein Knopf gedrückt, losgelassen oder gehalten wird. Im Fall von "gehalten" kannst du entscheiden wie häufig die Aktion ausgeführt werden soll.

source: Use this script to perform an action repeatedly.
de: Benutze dieses Skript um eine Aktion wiederholt auszuführen.

source: Is Trigger
de: Ist Auslöser

source: Background Color
de: Hintergrundfarbe

source: Frame Size
de: Rahmengröße

source: Add Camera Follow script
de: "CameraFollow"-Skript hinzufügen

source: A Collider marked as "Trigger" is a special type of collider that can't be touched by other things, but it still detects if another GameObject enters it. Useful for Area Condition scripts.
de: Ein Collider, der als "Auslöser" makiert ist, ist ein spezieller Typ von Collider, der nicht von anderen Collidern berührt werden kann, aber erkennt wenn andere GameObjects ihn betreten. Nützlich für gebietsbedingte Skripte.

source: Extra Options
de: Zusatzoptionen

source: Select
de: Auswählen

source: Revert
de: Zurücksetzen

source: Apply
de: Übernehmen

source: Mass
de: Masse

source: Friction
de: Reibung

source: Angular Friction
de: Drehungsreibung

source: Gravity
de: Schwerkraft

source: Freeze Position
de: Position einfrieren

source: Freeze Rotation
de: Drehung einfrieren

source: Select one GameObject at a time to modify constraints
de: Wähle nur ein GameObject um Einschränkungen an diesem zu machen.

source: Flip
de: Umdrehen

source: Adaptability
de: Anpassbarkeit

source: Visibility Options
de: Sichtbarkeitseinstellungen

source: Sorting Layer
de: Sortierebenen

source: Edit Sorting Layer
de: Ebenen-Sortierung bearbeiten

source: Order in Layer
de: Ebenenreihenfolge

source: Edit Sorting Order
de: Sortierreihenfolge bearbeiten

source: Rotation
de: Drehung

source: Scale
de: Skalierung

source: Creates an object repeatedly in a square area. The size of the area is defined by the size of BoxCollider2D, while Spawn Interval defines the delay of spawning.
de: Erstellt immer wieder Objekte in dem quadratischen Feld. Die Feldgröße wird über den "BoxCollider2D" vorgegeben, während der Wert "Spawn Interval" die Spawn-Verzögerung festlegt.

source: Spawns an object at the press of a button and it applies a force to it in the direction chosen.
de: Erzeugt ein Objekt, wenn ein Knopf gedrückt wird und beschleunigt es in die Zielrichtung.

source: WARNING: Don't forget to apply a Rigidbody2D to your projectiles, or they won't move!
de: WARNUNG: Vergiss nicht, ein Rigidbody2D zu deinen Projektilen hinzufügen oder sie werden sich nicht bewegen.

source: The Player can pick up and drop objects by pressing a key.
de: Der Spieler kann Objekte aufheben oder fallen lassen, wenn eine Taste gedrückt wird.

source: The Pickup object must be tagged 'Pickup' and have component Rigidbody2D
de: Das aufhebbare Objekt muss den Tag "Pickup" und die Komponente "Rigidbody2D" haben

source: This GameObject will self destruct after a set amount of time, useful for bullets so they don't accumulate.
de: Dieses Objekt wird sich selbst nach einer gegebenen Zeit zerstören. Das ist nützlich um beispielsweise Waffen-Projektile zu zerstören, damit diese sich nicht unnötig ansammeln.

source: Turned Playground off
de: Playground wurde ausgeschalten

source: Turned Playground on
de: Playground wurde eingeschaltet

source: The GameObject moves automatically in a specific direction.
de: Das GameObject bewegt sich automatisch in eine Richtung.

source: The GameObject rotates automatically.
de: Das GameObject rotiert automatisch.

source: TIP: Use negative value to rotate in the other direction.
de: Tipp: Benutze negative Werte um dich in die andere Richtung zu drehen.

source: This script makes the Camera follow a specific object (usually the Player).
de: Dieses Skript sorgt dafür, dass die Kamera ein Objekt verfolgt (normalerweise der Spieler).

source: WARNING: No object is selected, so the Camera will not move.
de: WARNUNG: Es ist kein Objekt ausgewählt, sodass sich die Kamera nicht bewegt.

source: This script requires a Camera component to work. Add it to the Camera GameObject.
de: Dieses Skript benötigt eine Kamera um zu funktionieren. Füge es zum Kamera-GameObject hinzu.

source: Limits
de: Begrenzungen

source: Use Bounds
de: Benutze Objektgrenzen

source: This GameObject will pursue a target constantly.
de: Dieses Objekt wird ein anderes Objekt durchgehend verfolgen.

source: Look at target
de: Ziel angucken

source: Makes the GameObject jump at the press of a button.
de: Lässt das GameObject springen, wenn eine Taste gedrückt wird.

source: Enable ground check to restrict the Player from jumping while in the air.
de: Aktiviere "Untergrund prüfen" um zu verhindern, dass der Spieler in der Luft springen kann.

source: Ground setup
de: Boden Einstellungen

source: Check ground
de: Untergrund prüfen

source: Ground tag
de: Boden-Tag

source: The GameObject moves when pressing specific keys. Choose between Arrows or WASD.
de: Das GameObject bewegt sich bei Tastendruck. Entscheide dich zwischen WASD- und Pfeiltasten.

source: If you want, you can constrain movement on the X/Y axes in the Rigidbody2D's properties.
de: Wenn du möchtest, kannst du die Bewegung in X/Y Richtung einschränken. Gehe dazu in die Eigenschaften von "Rigidbody2D".

source: Orientation
de: Ausrichtung

source: Orient to direction
de: In Bewegungsrichtung drehen.

source: The object moves through a series of positions. This can be used for patrolling characters.
de: Das GameObject wird sich entlang der definierten Punkte bewegen. Dies kann verwendet werden um Objekte "patrouillieren" zu lassen.

source: The list of waypoints is empty, so the GameObject will not move.
de: Es sind keine Wegpunkte festgelegt. Das GameObject wird sicht nicht bewegen.

source: Stops
de: Wegpunkte

source: Reset Waypoints
de: Wegpunkte zurücksetzen

source: The GameObject will move at the push of a button, as if a thruster or an invisible force was pushing it.
de: Das GameObject bewegt sich bei Tastendruck, als würde es in eine Richtung gedrückt werden.

source: TIP: The GameObject will always move in the direction chosen regardless of its orientation.
de: Hinweis: Das GameoObject wird sich immer in die festgelegte Richtung bewegen, unabhängig von seiner Ausrichtung.

source: TIP: The GameObject will move in the direction chosen relative to its orientation.
de: Hinweis: Das GameObject wird sich immer in die Richtung relativ zu seiner Drehung bewegen.

source: The GameObject rotates when pressing the Arrow keys or WASD.
de: Das GameObject rotiert bei Tastendruck. Entscheide dich zwischen WASD und Pfeiltasten.

source: The GameObject will move around randomly. Use keepNearStartingPoint if you want it to keep near its starting position.
de: Das GameObject wird sich zufällig bewegen. Aktiviere "keepNearStartingPoint" damit sich das GameObject nicht zu weit enfernt.

source: This is the list of Resources present in the game. Add and/or remove names here first, then go back to your Resource GameObjects and assign them a type.
de: Dies ist eine Liste von Ressourcen im Spiel. Füge erst Sachen hier hinzu und/oder entferne welche. Dann kannst du in deinen GameObjects einen Typen festlegen.

source: Resource types
de: Ressourcentyp

source: This script is responsible of creating dialogue balloons. Create dialogues by using DialogueBalloonAction in Conditions.
de: Dieses Skript ist verantwortlich für die Erstellung von Dialog-Blasen. Du kannst Dialoge mit "DialogueBalloonAction" (in Bedingungen) erstellen.

source: Use the UI to visualise points and health for the players.
de: Benutze das UI um Punkte und Leben von Spielern anzuzeigen.

source: Don't forget to use the script HealthSystemAttribute on the player(s)!
de: Vergiss nicht, das "HealthSystemAttribute"-Skript auf die Spieler anzuwenden.

source: One player
de: Ein Spieler

source: Two players
de: Zwei Spieler

source: Score
de: Punkte

source: Life
de: Leben

source: Endless
de: Endlos

source: Number of players
de: Spieleranzahl

source: Game type
de: Spieltyp

source: press {0}
de: drücker {0}

source: Player {0} wins!
de: Spieler {0} gewinnt!

source: Collider2D needed
de: "Collider2D" notwendig

source: This script requires a Collider2D to work. Which shape do you want it to be? If you are not sure, choose Polygon.
de: Dieses Skript benötigt einen "Collider2D". Welche Form soll dieser haben? Wenn du dir unsicher bist wähle "Polygon".

source: Circle
de: Kreis

source: Rectangle
de: Rechteck

source: Please add a Collider2D of any type or the script will not work as expected.
de: Bitte füge ein "Collider2D" hinzu, da sonst das Skript nicht funktioniert.

source: Direction
de: Richtung

source: Relative To Rotation
de: Relativ zur Drehung

source: Rotation Speed
de: Drehgeschwindigkeit

source: Limit Bounds
de: Begrenzung aktivieren

source: Left
de: Links

source: Right
de: Rechts

source: Bottom
de: Unten

source: Top
de: Oben

source: Target
de: Ziel

source: Speed
de: Geschwindigkeit

source: Use Side
de: Benutze Seite

source: Up
de: Oben

source: Down
de: Unten

source: Key
de: Taste

source: Jump Strength
de: Sprungkraft

source: Check Ground
de: Boden testen

source: Ground Tag
de: Boden-Tag

source: Type Of Control
de: Kontroll-Schema

source: Movement Type
de: Bewegungs-Schema

source: Movement
de: Bewegung

source: Input Keys
de: Eingabe

source: Orient To Direction
de: Drehung berücksichtigen

source: ArrowKeys
de: Pfeiltasten

source: AllDirections
de: Alle Richtungen

source: OnlyHorizontal
de: Nur horizontal

source: OnlyVertical
de: Nur vertikal

source: Look Axis
de: Richtung

source: Direction and Strength
de: Richtung und Stärke

source: Push Strength
de: Stärke

source: Axis
de: Achse

source: Relative Axis
de: Relativ zur Achse

source: Direction Change Interval
de: Intervall für Richtungsänderung

source: Keep Near Starting Point
de: Im Startgebiet bleiben

source: Object creation
de: Objekterstellung

source: Other options
de: Andere Einstellungen

source: Prefab To Spawn
de: Ersellbares Prefab

source: Prefab To Create
de: Ersellbares Prefab

source: Spawn Interval
de: Erstellungsinverval

source: Creation Rate
de: Erstellungsgeschwindigkeit

source: Key To Press
de: Taste

source: Shoot Speed
de: Projektilgeschwindigkeit

source: Shoot Direction
de: Schussrichtung

source: Pickup Key
de: Aufheben-Taste

source: Drop Key
de: Fallenlassen-Taste

source: Pick Up Distance
de: Aufheben-Reichweite

source: Time To Destruction
de: Zeit bis Zerstörung

source: Points Worth
de: Wert (Punkte)

source: Health
de: Leben

source: Health Change
de: Lebensänderung

source: Destroy When Activated
de: Bei Aktivierung zerstören

source: Amount
de: Menge

source: Use Custom Actions
de: Eigene Aktionen verwenden

source: Event Type
de: Eventtyp

source: Type of Event
de: Eventtyp

source: Happen Only Once
de: Einmalig

source: Frequency
de: Häufigkeit

source: JustPressed
de: Gerade Gedrückt

source: Released
de: Losgelassen

source: KeptPressed
de: Gedrückt halten

source: Initial Delay
de: Startverzögerung

source: Amount Needed
de: Benötigte Menge

source: New Position
de: Neue Position

source: Relative To This Object
de: Relativ zu diesem Objekt

source: Death Effect
de: Effekt bei Tod

source: ObjectThatCollided
de: Berührtes Objekt

source: ThisObject
de: Dieses Objekt

source: Contents
de: Inhalt

source: Options
de: Einstellungen

source: Continue dialogue
de: Dialog fortführen

source: Text Color
de: Textfarbe

source: Text To Display
de: Text

source: Target Object
de: Zielobjekt

source: Disappear Mode
de: Ausblenden-Modus

source: Following Text
de: Nächster Text

source: ButtonPress
de: Tastendruck

source: Time
de: Zeit

source: Time To Disappear
de: Ausblenden-Zeit

source: Object To Affect
de: Betroffenes Objekt

source: Just Make Invisible
de: Nur unsichtbar machen

source: Object To Move
de: Zu bewegendes Objekt

source: Stop Movements
de: Bewegung stoppen

source: Score To Win
de: Erforderliche Punkte
